SpenceKonde/megaTinyCore/megaavr/boards.txt
### BOD MODE
atxy4.menu.bodmode.disabled=Disabled/Disabled
atxy4.menu.bodmode.enabled=Enabled/Enabled
atxy4.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy4.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy4.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy4.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy4.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy4.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy4.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy4.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy4.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy4.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy4.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy4.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy4.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy4.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy4.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy4.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### EEPROM RETAIN
atxy4.menu.eesave.enable=EEPROM retained
atxy4.menu.eesave.enable.bootloader.eesavebit=1
atxy4.menu.eesave.disable=EEPROM not retained
atxy4.menu.eesave.disable.bootloader.eesavebit=0

### MILLIS TIMER
atxy4.menu.millis.enabled=Enabled (default timer)
atxy4.menu.millis.disabled=Disabled (saves flash)
atxy4.menu.millis.timera=TCA0 (default on 0-series)
atxy4.menu.millis.timerd=TCD0 (1-series only, default there)
atxy4.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy4.menu.millis.timerb1=TCB1 (1614, 2-series only)
atxy4.menu.millis.rtc=RTC (no micros)
atxy4.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atxy4.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only no micros)
atxy4.menu.millis.disabled.build.millistimer=NONE
atxy4.menu.millis.timera.build.millistimer=A0
atxy4.menu.millis.timerd.build.millistimer=D0
atxy4.menu.millis.timerb0.build.millistimer=B0
atxy4.menu.millis.timerb1.build.millistimer=B1
atxy4.menu.millis.rtc.build.millistimer=RTC
atxy4.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy4.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

### UPDI/RESET PIN CONFIGURATION
#Expert mode - if you understand what these mean, uncomment them to enable.
#there are a few lines like this in platform.txt too that can be uncommented to enable for uploads, not just when burning bootloader
#atxy4.menu.resetpin.UPDI=UPDI (no reset pin)
#atxy4.menu.resetpin.UPDI.bootloader.resetpinbits=01
#atxy4.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
#atxy4.menu.resetpin.reset.bootloader.resetpinbits=10
#atxy4.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
#atxy4.menu.resetpin.gpio.bootloader.resetpinbits=00


### STARTUP TIME (SUT)
atxy4.menu.startuptime.8=8ms
atxy4.menu.startuptime.0=0ms
atxy4.menu.startuptime.1=1ms
atxy4.menu.startuptime.2=2ms
atxy4.menu.startuptime.4=4ms
atxy4.menu.startuptime.16=16ms
atxy4.menu.startuptime.32=32ms
atxy4.menu.startuptime.64=64ms
atxy4.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy4.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy4.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy4.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy4.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy4.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy4.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy4.menu.startuptime.64.bootloader.SYSCFG1=0x07


### TWI OPTIONS
atxy4.menu.wire.mors=Master or Slave (saves Flash & RAM)
atxy4.menu.wire.mors.build.wire=MORS
atxy4.menu.wire.mands=Master and Slave
atxy4.menu.wire.mands.build.wire=MANDS

############################################################################
#  Non-bootloader                                                          #
#                                     ###      ####   ###  #   #         ###
#  ATtiny412                         #   #     #   #   #   ##  #       #####
#  ATtiny402                          ###  === ####    #   # # #     #######
#  ATtiny212                         #   #     #       #   #  ##       #####
#  ATtiny202                          ###      #      ###  #   #         ###
#__________________________________________________________________________#

### BUILD PARAMETERS
atxy2.build.text_section_start=.text=0x0
atxy2.build.millistimer=D0
atxy2.build.bootload=
atxy2.bootloader.resetpinbits=01
atxy2.build.board=AVR_ATtinyxy2
atxy2.build.clocksource=0
atxy2.build.core=megatinycore
atxy2.build.variant=txy2
atxy2.build.tuned=
atxy2.build.mcu=attiny{build.attiny}
atxy2.build.f_cpu={build.speed}000000L
atxy2.build.extra_flags=-DARDUINO_attinyxy2 -DMILLIS_USE_TIMER{build.millistimer} -DTWI_{build.wire} {build.tuned}
atxy2.build.export_merged_output=false

### BOOTLOADING PARAMETERS (FUSES)
atxy2.bootloader.WDTCFG=0x00
atxy2.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy2.bootloader.OSCCFG=0x01
atxy2.bootloader.TCD0CFG_avrdude=
atxy2.bootloader.TCD0CFG_serialupdi=
atxy2.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy2.bootloader.APPEND=0x00
atxy2.bootloader.BOOTEND=0x00
atxy2.bootloader.tool=avrdude
atxy2.bootloader.avrdudestring=
atxy2.bootloader.serialupdistring=-aerase


### ALL UPLOADING VIA UPDI
atxy2.upload.tool=avrdude
atxy2.upload.workaround=
atxy2.upload.with_programmer_not_available_for_bootloader_boards=

### CHIP
atxy2.menu.chip.412=ATtiny412
atxy2.menu.chip.412.build.board=AVR_ATtiny412
atxy2.menu.chip.412.build.attiny=412
atxy2.menu.chip.412.upload.maximum_size=4096
atxy2.menu.chip.412.upload.maximum_data_size=256
atxy2.menu.chip.412.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy2.menu.chip.412.bootloader.TCD0CFG_serialupdi=4:0x00
atxy2.menu.chip.212=ATtiny212
atxy2.menu.chip.212.build.board=AVR_ATtiny212
atxy2.menu.chip.212.build.attiny=212
atxy2.menu.chip.212.upload.maximum_size=2048
atxy2.menu.chip.212.upload.maximum_data_size=128
atxy2.menu.chip.212.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy2.menu.chip.212.bootloader.TCD0CFG_serialupdi=4:0x00
atxy2.menu.chip.402=ATtiny402
atxy2.menu.chip.402.build.board=AVR_ATtiny402
atxy2.menu.chip.402.build.attiny=402
atxy2.menu.chip.402.build.millistimer=A0
atxy2.menu.chip.402.upload.maximum_size=4096
atxy2.menu.chip.402.upload.maximum_data_size=256
atxy2.menu.chip.402.bootloader.TCD0CFG_avrdude=
atxy2.menu.chip.402.bootloader.TCD0CFG_serialupdi=
atxy2.menu.chip.402w=ATtiny402 (bad signature)
atxy2.menu.chip.402w.build.millistimer=A0
atxy2.menu.chip.402w.build.board=AVR_ATtiny402
atxy2.menu.chip.402w.upload.maximum_size=4096
atxy2.menu.chip.402w.upload.maximum_data_size=256
atxy2.menu.chip.402w.upload.workaround=w
atxy2.menu.chip.402w.bootloader.TCD0CFG_avrdude=
atxy2.menu.chip.402w.bootloader.TCD0CFG_serialupdi=
atxy2.menu.chip.202=ATtiny202
atxy2.menu.chip.202.build.board=AVR_ATtiny202
atxy2.menu.chip.202.build.attiny=202
atxy2.menu.chip.202.build.millistimer=A0
atxy2.menu.chip.202.upload.maximum_size=2048
atxy2.menu.chip.202.upload.maximum_data_size=128
atxy2.menu.chip.202.bootloader.TCD0CFG_avrdude=
atxy2.menu.chip.202.bootloader.TCD0CFG_serialupdi=

### CLOCK SOURCE
atxy2.menu.clock.20internal=20 MHz internal
atxy2.menu.clock.16internal=16 MHz internal
atxy2.menu.clock.10internal=10 MHz internal
atxy2.menu.clock.8internal=8 MHz internal
atxy2.menu.clock.5internal=5 MHz internal
atxy2.menu.clock.4internal=4 MHz internal
atxy2.menu.clock.1internal=1 MHz internal
atxy2.menu.clock.20internaltuned=20 MHz internal - tuned
atxy2.menu.clock.16internaltuned=16 MHz internal - tuned
atxy2.menu.clock.12internaltuned=12 MHz internal - tuned
atxy2.menu.clock.20extclock=20 MHz external clock
atxy2.menu.clock.16extclock=16 MHz external clock
atxy2.menu.clock.12extclock=12 MHz external clock
atxy2.menu.clock.10extclock=10 MHz external clock
atxy2.menu.clock.8extclock=8 MHz external clock
atxy2.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
atxy2.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
atxy2.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy2.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atxy2.menu.clock.24extclock=24 MHz external clock - overclocked
atxy2.menu.clock.25extclock=25 MHz external clock - overclocked
atxy2.menu.clock.30extclock=30 MHz external clock - overclocked, may be unstable
atxy2.menu.clock.32extclock=32 MHz external clock - overclocked, may be unstable
atxy2.menu.clock.20internal.build.speed=20
atxy2.menu.clock.20internal.build.clocksource=0
atxy2.menu.clock.16internal.build.speed=16
atxy2.menu.clock.16internal.build.clocksource=0
atxy2.menu.clock.10internal.build.speed=10
atxy2.menu.clock.10internal.build.clocksource=0
atxy2.menu.clock.8internal.build.speed=8
atxy2.menu.clock.8internal.build.clocksource=0
atxy2.menu.clock.5internal.build.speed=5
atxy2.menu.clock.5internal.build.clocksource=0
atxy2.menu.clock.4internal.build.speed=4
atxy2.menu.clock.4internal.build.clocksource=0
atxy2.menu.clock.1internal.build.speed=1
atxy2.menu.clock.1internal.build.clocksource=0
atxy2.menu.clock.20extclock.build.speed=20
atxy2.menu.clock.20extclock.build.clocksource=2
atxy2.menu.clock.16extclock.build.speed=16
atxy2.menu.clock.16extclock.build.clocksource=2
atxy2.menu.clock.12extclock.build.speed=12
atxy2.menu.clock.12extclock.build.clocksource=2
atxy2.menu.clock.10extclock.build.speed=10
atxy2.menu.clock.10extclock.build.clocksource=2
atxy2.menu.clock.8extclock.build.speed=8
atxy2.menu.clock.8extclock.build.clocksource=2
atxy2.menu.clock.24extclock.build.speed=24
atxy2.menu.clock.24extclock.build.clocksource=2
atxy2.menu.clock.25extclock.build.speed=24
atxy2.menu.clock.25extclock.build.clocksource=2
atxy2.menu.clock.30extclock.build.speed=30
atxy2.menu.clock.30extclock.build.clocksource=2
atxy2.menu.clock.32extclock.build.speed=32
atxy2.menu.clock.32extclock.build.clocksource=2
atxy2.menu.clock.20internaltuned.build.speed=20
atxy2.menu.clock.20internaltuned.build.clocksource=0
atxy2.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.16internaltuned.build.speed=16
atxy2.menu.clock.16internaltuned.build.clocksource=0
atxy2.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.12internaltuned.build.speed=12
atxy2.menu.clock.12internaltuned.build.clocksource=0
atxy2.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.24internaltuned.build.speed=24
atxy2.menu.clock.24internaltuned.build.clocksource=0
atxy2.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.25internaltuned.build.speed=25
atxy2.menu.clock.25internaltuned.build.clocksource=0
atxy2.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.30internaltuned.build.speed=30
atxy2.menu.clock.30internaltuned.build.clocksource=0
atxy2.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.32internaltuned.build.speed=32
atxy2.menu.clock.32internaltuned.build.clocksource=0
atxy2.menu.clock.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.32internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy2.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy2.menu.clock.5internal.bootloader.OSCCFG=0x02

### BOD VOLTAGE
atxy2.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy2.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy2.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy2.menu.bodvoltage.2v1=2.1V
atxy2.menu.bodvoltage.2v9=2.9V
atxy2.menu.bodvoltage.3v3=3.3V
atxy2.menu.bodvoltage.3v7=3.7V
atxy2.menu.bodvoltage.4v0=4.0V
atxy2.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy2.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy2.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy2.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy2.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy2.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy2.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy2.menu.bodvoltage.2v1.bootloader.bodlevbits=001

