SpenceKonde/megaTinyCore/megaavr/boards.txt
### BOD MODE
atxy2.menu.bodmode.disabled=Disabled/Disabled
atxy2.menu.bodmode.enabled=Enabled/Enabled
atxy2.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy2.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy2.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy2.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy2.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy2.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy2.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy2.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy2.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy2.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy2.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy2.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy2.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy2.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy2.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy2.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### EEPROM RETAIN
atxy2.menu.eesave.enable=EEPROM retained
atxy2.menu.eesave.enable.bootloader.eesavebit=1
atxy2.menu.eesave.disable=EEPROM not retained
atxy2.menu.eesave.disable.bootloader.eesavebit=0

### MILLIS TIMER
atxy2.menu.millis.enabled=Enabled (default timer)
atxy2.menu.millis.disabled=Disabled (saves flash)
atxy2.menu.millis.timera=TCA0 (default on 402/202)
atxy2.menu.millis.timerd=TCD0 (412/212 only, default there)
atxy2.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy2.menu.millis.rtc=RTC (no micros)
atxy2.menu.millis.disabled.build.millistimer=NONE
atxy2.menu.millis.timera.build.millistimer=A0
atxy2.menu.millis.timerd.build.millistimer=D0
atxy2.menu.millis.timerb0.build.millistimer=B0
atxy2.menu.millis.rtc.build.millistimer=RTC

### UPDI/RESET PIN CONFIGURATION
#Expert mode - if you understand what these mean, uncomment them to enable.
#there are a few lines like this in platform.txt too that can be uncommented to enable for uploads, not just when burning bootloader
#atxy2.menu.resetpin.UPDI=UPDI (no reset pin)
#atxy2.menu.resetpin.UPDI.bootloader.resetpinbits=01
#atxy2.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
#atxy2.menu.resetpin.reset.bootloader.resetpinbits=10
#atxy2.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
#atxy2.menu.resetpin.gpio.bootloader.resetpinbits=00

### STARTUP TIME (SUT)
atxy2.menu.startuptime.8=8ms
atxy2.menu.startuptime.0=0ms
atxy2.menu.startuptime.1=1ms
atxy2.menu.startuptime.2=2ms
atxy2.menu.startuptime.4=4ms
atxy2.menu.startuptime.16=16ms
atxy2.menu.startuptime.32=32ms
atxy2.menu.startuptime.64=64ms
atxy2.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy2.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy2.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy2.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy2.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy2.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy2.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy2.menu.startuptime.64.bootloader.SYSCFG1=0x07


### TWI OPTIONS
atxy2.menu.wire.mors=Master or Slave (x12 only)
atxy2.menu.wire.mors.build.wire=MORS
atxy2.menu.wire.mands=Master and Slave (x12 only)
atxy2.menu.wire.mands.build.wire=MANDS

############################################################################
#  Non-bootloader                                                          #
# Curiosity Nano    #   # ###  ### ####   ###   ### #  # ### ####        ###
# Xplained Mini     ## ##  #  #    #   # #   # #    #  #  #  #   #     #####
# Xplained Pro      # # #  #  #    ####  #   # #    ####  #  ####    #######
#                   #   #  #  #    # #   #   # #    #  #  #  #         #####
#                   #   # ###  ### #  ##  ###   ### #  # ### #           ###
#__________________________________________________________________________#

### BUILD PARAMETERS
microchip.build.text_section_start=.text=0x0
microchip.build.millistimer=D0
microchip.build.bootload=
microchip.build.clocksource=0
microchip.build.core=megatinycore
microchip.build.variant=txy7
microchip.build.tuned=
microchip.build.mcu=attiny{build.attiny}
microchip.build.f_cpu={build.speed}000000L
microchip.build.export_merged_output=false
microchip.build.board=Microchip Placeholder

### BOOTLOADING PARAMETERS (FUSES)
microchip.bootloader.WDTCFG=0x00
microchip.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
microchip.bootloader.OSCCFG=0x01
microchip.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
microchip.bootloader.TCD0CFG_serialupdi=4:0x00
microchip.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
microchip.bootloader.APPEND=0x00
microchip.bootloader.BOOTEND=0x00
microchip.bootloader.tool=avrdude

### ALL UPLOADING VIA UPDI
microchip.upload.tool=avrdude
microchip.upload.workaround=
microchip.upload.with_programmer_not_available_for_bootloader_boards=
microchip.upload.extra_params=-Pusb
microchip.upload.serialparams=

### CHIP
microchip.menu.board_name.cn3217=Curiosity Nano ATtiny3217
microchip.menu.board_name.cn3217.build.board=AVR_CuriosityNano3217
microchip.menu.board_name.cn3217.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DTWI_{build.wire} -DLED_BUILTIN=PIN_PA3 -DPIN_BUTTON_BUILTIN=PIN_PB7 {build.tuned}
microchip.menu.board_name.cn3217.build.attiny=3217
microchip.menu.board_name.cn3217.upload.protocol=curiosity_updi
microchip.menu.board_name.cn3217.upload.maximum_size=32768
microchip.menu.board_name.cn3217.upload.maximum_data_size=2048

microchip.menu.board_name.cn1627=Curiosity Nano ATtiny1627
microchip.menu.board_name.cn1627.build.board=AVR_CuriosityNano1627
microchip.menu.board_name.cn1627.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DTWI_{build.wire} -DLED_BUILTIN=PIN_PB4 -DPIN_BUTTON_BUILTIN=PIN_PB7
microchip.menu.board_name.cn1627.build.millistimer=B1
microchip.menu.board_name.cn1627.build.attiny=1627
microchip.menu.board_name.cn1627.upload.protocol=curiosity_updi
microchip.menu.board_name.cn1627.upload.maximum_size=16384
microchip.menu.board_name.cn1627.upload.maximum_data_size=2048
microchip.menu.board_name.cn1627.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
microchip.menu.board_name.cn1627.bootloader.TCD0CFG_avrdude=
microchip.menu.board_name.cn1627.bootloader.TCD0CFG_serialupdi=

microchip.menu.board_name.cn1607=Curiosity Nano ATtiny1607
microchip.menu.board_name.cn1607.build.board=AVR_CuriosityNano1607
microchip.menu.board_name.cn1607.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DTWI_{build.wire} -DLED_BUILTIN=PIN_PC4 -DPIN_BUTTON_BUILTIN=PIN_PB7
microchip.menu.board_name.cn1607.build.attiny=1607
microchip.menu.board_name.cn1607.build.millistimer=A0
microchip.menu.board_name.cn1607.upload.protocol=curiosity_updi
microchip.menu.board_name.cn1607.upload.extra_params=-Pusb
microchip.menu.board_name.cn1607.upload.maximum_size=16384
microchip.menu.board_name.cn1607.upload.maximum_data_size=1024
microchip.menu.board_name.cn1607.bootloader.TCD0CFG_avrdude=
microchip.menu.board_name.cn1607.bootloader.TCD0CFG_serialupdi=

microchip.menu.board_name.xp3217=Xplained Pro ATtiny3217
microchip.menu.board_name.xp3217.build.board=AVR_Xplained_Pro_3217
microchip.menu.board_name.xp3217.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DTWI_{build.wire} -DLED_BUILTIN=PIN_PB4 -DPIN_BUTTON_BUILTIN=PIN_PB5
microchip.menu.board_name.xp3217.build.attiny=3217
microchip.menu.board_name.xp3217.build.millistimer=D0
microchip.menu.board_name.xp3217.upload.protocol=xplainedpro_updi
microchip.menu.board_name.xp3217.build.variant=atxy7
microchip.menu.board_name.xp3217.upload.maximum_size=32768
microchip.menu.board_name.xp3217.upload.maximum_data_size=2048

microchip.menu.board_name.xp817=Xplained Pro ATtiny817
microchip.menu.board_name.xp817.build.board=AVR_Xplained_Pro_817
microchip.menu.board_name.xp817.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DTWI_{build.wire} -DLED_BUILTIN=PIN_PB4 -DPIN_BUTTON_BUILTIN=PIN_PB5
microchip.menu.board_name.xp817.build.attiny=817
microchip.menu.board_name.xp817.build.millistimer=D0
microchip.menu.board_name.xp817.upload.protocol=xplainedpro_updi
microchip.menu.board_name.xp817.upload.maximum_size=8192
microchip.menu.board_name.xp817.upload.maximum_data_size=512

microchip.menu.board_name.xm817=Xplained Mini ATtiny817
microchip.menu.board_name.xm817.build.board=AVR_XplainedMini817
microchip.menu.board_name.xm817.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DTWI_{build.wire} -DLED_BUILTIN=PIN_PC0 -DPIN_BUTTON_BUILTIN=PIN_PC5
microchip.menu.board_name.xm817.build.attiny=817
microchip.menu.board_name.xm817.build.millistimer=D0
microchip.menu.board_name.xm817.upload.protocol=xplainedmini_updi
microchip.menu.board_name.xm817.upload.maximum_size=8192
microchip.menu.board_name.xm817.upload.maximum_data_size=512

microchip.menu.board_name.xn416=Xplained Nano ATtiny416
microchip.menu.board_name.xn416.build.board=AVR_XplainedNano416
microchip.menu.board_name.xn416.build.extra_flags=-DARDUINO_attinyxy6 -DMILLIS_USE_TIMER{build.millistimer} -DTWI_{build.wire} -DLED_BUILTIN=PIN_PB5 -DPIN_BUTTON_BUILTIN=PIN_PB4 -DUART0_SWAP
microchip.menu.board_name.xn416.build.attiny=416
microchip.menu.board_name.xn416.build.variant=txy6
microchip.menu.board_name.xn416.build.millistimer=A0
microchip.menu.board_name.xn416.upload.protocol=xplainedmini_updi
microchip.menu.board_name.xn416.upload.maximum_size=4096
microchip.menu.board_name.xn416.upload.maximum_data_size=256

### CLOCK SOURCE
microchip.menu.clock.20internal=20 MHz internal
microchip.menu.clock.16internal=16 MHz internal
microchip.menu.clock.10internal=10 MHz internal
microchip.menu.clock.8internal=8 MHz internal
microchip.menu.clock.5internal=5 MHz internal
microchip.menu.clock.4internal=4 MHz internal
microchip.menu.clock.1internal=1 MHz internal
microchip.menu.clock.20internaltuned=20 MHz internal - tuned
microchip.menu.clock.16internaltuned=16 MHz internal - tuned
microchip.menu.clock.12internaltuned=12 MHz internal - tuned
microchip.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
microchip.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
microchip.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
microchip.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
microchip.menu.clock.20internal.build.speed=20
microchip.menu.clock.20internal.build.clocksource=0
microchip.menu.clock.16internal.build.speed=16
microchip.menu.clock.16internal.build.clocksource=0
microchip.menu.clock.10internal.build.speed=10
microchip.menu.clock.10internal.build.clocksource=0
microchip.menu.clock.8internal.build.speed=8
microchip.menu.clock.8internal.build.clocksource=0
microchip.menu.clock.5internal.build.speed=5
microchip.menu.clock.5internal.build.clocksource=0
microchip.menu.clock.4internal.build.speed=4
microchip.menu.clock.4internal.build.clocksource=0
microchip.menu.clock.1internal.build.speed=1
microchip.menu.clock.1internal.build.clocksource=0
microchip.menu.clock.20internaltuned.build.speed=20
microchip.menu.clock.20internaltuned.build.clocksource=0
microchip.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.16internaltuned.build.speed=16
microchip.menu.clock.16internaltuned.build.clocksource=0
microchip.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.12internaltuned.build.speed=12
microchip.menu.clock.12internaltuned.build.clocksource=0
microchip.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.24internaltuned.build.speed=24
microchip.menu.clock.24internaltuned.build.clocksource=0
microchip.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.25internaltuned.build.speed=25
microchip.menu.clock.25internaltuned.build.clocksource=0
microchip.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.30internaltuned.build.speed=30
microchip.menu.clock.30internaltuned.build.clocksource=0
microchip.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.32internaltuned.build.speed=32
microchip.menu.clock.32internaltuned.build.clocksource=0
microchip.menu.clock.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
microchip.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
microchip.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
microchip.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
microchip.menu.clock.32internaltuned.bootloader.OSCCFG=0x02
microchip.menu.clock.20internal.bootloader.OSCCFG=0x02
microchip.menu.clock.10internal.bootloader.OSCCFG=0x02
microchip.menu.clock.5internal.bootloader.OSCCFG=0x02

### BOD VOLTAGE
microchip.menu.bodvoltage.1v8=1.8V (5 MHz or less)
microchip.menu.bodvoltage.2v6=2.6V (10 MHz or less)
microchip.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
microchip.menu.bodvoltage.2v1=2.1V
microchip.menu.bodvoltage.2v9=2.9V
microchip.menu.bodvoltage.3v3=3.3V
microchip.menu.bodvoltage.3v7=3.7V
microchip.menu.bodvoltage.4v0=4.0V
microchip.menu.bodvoltage.1v8.bootloader.bodlevbits=000
microchip.menu.bodvoltage.2v6.bootloader.bodlevbits=010
microchip.menu.bodvoltage.4v2.bootloader.bodlevbits=111
microchip.menu.bodvoltage.4v0.bootloader.bodlevbits=110
microchip.menu.bodvoltage.3v7.bootloader.bodlevbits=101
microchip.menu.bodvoltage.3v3.bootloader.bodlevbits=100
microchip.menu.bodvoltage.2v9.bootloader.bodlevbits=011
microchip.menu.bodvoltage.2v1.bootloader.bodlevbits=001

