SpenceKonde/megaTinyCore/megaavr/boards.txt
### BODVOLTAGE
atx27o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atx27o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atx27o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atx27o.menu.bodvoltage.2v1=2.1V
atx27o.menu.bodvoltage.2v9=2.9V
atx27o.menu.bodvoltage.3v3=3.3V
atx27o.menu.bodvoltage.3v7=3.7V
atx27o.menu.bodvoltage.4v0=4.0V
atx27o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atx27o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atx27o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atx27o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atx27o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atx27o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atx27o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atx27o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

### BODMODE
atx27o.menu.bodmode.disabled=Disabled/Disabled
atx27o.menu.bodmode.enabled=Enabled/Enabled
atx27o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atx27o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atx27o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atx27o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atx27o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atx27o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atx27o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atx27o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atx27o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atx27o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atx27o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atx27o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atx27o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atx27o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atx27o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atx27o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### UPDI + RESET PIN CONFIGURATION
atx27o.menu.resetpinopti_2.UPDIaltrst=UPDI on PA0, RST on PB4 (Optiboot for 1 sec after reset)
atx27o.menu.resetpinopti_2.UPDIaltrst.bootloader.file=optiboot_tx2z{bootloader.uartswap}_rst.hex
atx27o.menu.resetpinopti_2.UPDIaltrst.bootloader.resetpinbits=11
atx27o.menu.resetpinopti_2.UPDI=No RST, UPDI enabled, 8 sec Optiboot after power on or SW reset
atx27o.menu.resetpinopti_2.UPDI.bootloader.file=optiboot_tx2z{bootloader.uartswap}.hex
atx27o.menu.resetpinopti_2.UPDI.bootloader.resetpinbits=01
atx27o.menu.resetpinopti_2.UPDIFastBoot=Optiboot for 1 sec. after power-on & SW reset, no RST pin
atx27o.menu.resetpinopti_2.UPDIFastBoot.bootloader.file=optiboot_tx2z{bootloader.uartswap}_1sec.hex
atx27o.menu.resetpinopti_2.UPDIFastBoot.bootloader.resetpinbits=01
atx27o.menu.resetpinopti_2.reset=RST on PA0, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atx27o.menu.resetpinopti_2.reset.bootloader.file=optiboot_tx2z{bootloader.uartswap}_rst.hex
atx27o.menu.resetpinopti_2.reset.bootloader.resetpinbits=10
atx27o.menu.resetpinopti_2.gpio=PA0 is GPIO, Optiboot for 8 sec. after power-on & SW reset, no RST pin *DANGER* HV programmer req'd for reprogramming! (PCHV)
atx27o.menu.resetpinopti_2.gpio.bootloader.file=optiboot_tx2z{bootloader.uartswap}.hex
atx27o.menu.resetpinopti_2.gpio.bootloader.resetpinbits=00

### STARTUP TIME (SUT)
atx27o.menu.startuptimeopti.8=8ms
atx27o.menu.startuptimeopti.0=0ms
atx27o.menu.startuptimeopti.1=1ms
atx27o.menu.startuptimeopti.2=2ms
atx27o.menu.startuptimeopti.4=4ms
atx27o.menu.startuptimeopti.16=16ms
atx27o.menu.startuptimeopti.32=32ms
atx27o.menu.startuptimeopti.64=64ms
atx27o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atx27o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atx27o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atx27o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atx27o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atx27o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atx27o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atx27o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

### BOOTLOADER UART PINS
atx27o.menu.bootloaderuart.default=TX:9 (PB2), RX:8 (PB3) (UART0 default pins)
atx27o.menu.bootloaderuart.alternate=TX:18 (PA1), RX:19 (PA2) (UART0 alt pins)
atx27o.menu.bootloaderuart.alternate1=TX:14 (PC2), RX:13 (PC1) (UART1 alt pins)
atx27o.menu.bootloaderuart.default.bootloader.uartswap=
atx27o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt
atx27o.menu.bootloaderuart.alternate1.bootloader.uartswap=_u1alt

### TWI OPTIONS
atx27o.menu.wire.mors=Master or Slave (saves Flash & RAM)
atx27o.menu.wire.mors.build.wire=MORS
atx27o.menu.wire.mands=Master and Slave
atx27o.menu.wire.mands.build.wire=MANDS

############################################################################
#  WITH OPTIBOOT                                                         ###
#  0/1-series                    ##    ###      ####   ###  #   #        ###
#                               #  #  #   #     #   #   #   ##  #        ###
#  ATtiny3216/1616/1606           #   #   # === ####    #   # # #        ###
#  ATtiny816/806                 #    #   #     #       #   #  ##        ###
#  ATtiny416/406                ####   ###      #      ###  #   #        ###
#________________________________________________________________________###

### BUILD PARAMETERS
atxy6o.build.text_section_start=.text=0x200
atxy6o.build.millistimer=D0
atxy6o.build.bootload=opti
atxy6o.build.board=AVR_ATtinyxy6
atxy6o.build.clocksource=0
atxy6o.build.core=megatinycore
atxy6o.build.variant=txy6
atxy6o.build.tuned=
atxy6o.build.mcu=attiny{build.attiny}
atxy6o.build.f_cpu={build.speed}000000L
atxy6o.build.extra_flags=-DARDUINO_attinyxy6 -DMILLIS_USE_TIMER{build.millistimer} -DTWI_{build.wire} -DUSING_OPTIBOOT {build.tuned}
atxy6o.build.export_merged_output=true

### BOOTLOADING PARAMETERS
atxy6o.bootloader.WDTCFG=0x00
atxy6o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy6o.bootloader.OSCCFG=0x01
atxy6o.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy6o.bootloader.TCD0CFG_serialupdi=4:0x00
atxy6o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy6o.bootloader.APPEND=0x00
atxy6o.bootloader.BOOTEND=0x02
atxy6o.bootloader.tool=avrdude
atxy6o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy6o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write

### UPLOAD VIA OPTIBOOT
atxy6o.upload.workaround=
atxy6o.upload.tool=avrdude
atxy6o.upload.serialparams=-P{serial.port} -b115200
atxy6o.upload.protocol=arduino
atxy6o.upload.extra_params=-D

### CHIP
atxy6o.menu.chip.3216=ATtiny3216
atxy6o.menu.chip.3216.build.board=AVR_ATtiny3216
atxy6o.menu.chip.3216.build.attiny=3216
atxy6o.menu.chip.3216.upload.maximum_size=32256
atxy6o.menu.chip.3216.upload.maximum_data_size=2048
atxy6o.menu.chip.1616=ATtiny1616
atxy6o.menu.chip.1616.build.board=AVR_ATtiny1616
atxy6o.menu.chip.1616.build.attiny=1616
atxy6o.menu.chip.1616.upload.maximum_size=15872
atxy6o.menu.chip.1616.upload.maximum_data_size=2048
atxy6o.menu.chip.816=ATtiny816
atxy6o.menu.chip.816.build.board=AVR_ATtiny816
atxy6o.menu.chip.816.build.attiny=816
atxy6o.menu.chip.816.upload.maximum_size=7680
atxy6o.menu.chip.816.upload.maximum_data_size=512
atxy6o.menu.chip.416=ATtiny416
atxy6o.menu.chip.416.build.board=AVR_ATtiny416
atxy6o.menu.chip.416.build.attiny=416
atxy6o.menu.chip.416.upload.maximum_size=3584
atxy6o.menu.chip.416.upload.maximum_data_size=256
atxy6o.menu.chip.1606=ATtiny1606
atxy6o.menu.chip.1606.build.board=AVR_ATtiny1606
atxy6o.menu.chip.1606.build.attiny=1606
atxy6o.menu.chip.1606.build.millistimer=A0
atxy6o.menu.chip.1606.upload.maximum_size=15872
atxy6o.menu.chip.1606.upload.maximum_data_size=1024
atxy6o.menu.chip.1606.bootloader.TCD0CFG_avrdude=
atxy6o.menu.chip.1606.bootloader.TCD0CFG_serialupdi=
atxy6o.menu.chip.806=ATtiny806
atxy6o.menu.chip.806.build.board=AVR_ATtiny806
atxy6o.menu.chip.806.build.attiny=806
atxy6o.menu.chip.806.build.millistimer=A0
atxy6o.menu.chip.806.upload.maximum_size=7680
atxy6o.menu.chip.806.upload.maximum_data_size=512
atxy6o.menu.chip.806.bootloader.TCD0CFG_avrdude=
atxy6o.menu.chip.806.bootloader.TCD0CFG_serialupdi=
atxy6o.menu.chip.406=ATtiny406
atxy6o.menu.chip.406.build.board=AVR_ATtiny406
atxy6o.menu.chip.406.build.attiny=406
atxy6o.menu.chip.406.build.millistimer=A0
atxy6o.menu.chip.406.upload.maximum_size=3584
atxy6o.menu.chip.406.upload.maximum_data_size=256
atxy6o.menu.chip.406.bootloader.TCD0CFG_avrdude=
atxy6o.menu.chip.406.bootloader.TCD0CFG_serialupdi=

### CLOCK SOURCE
atxy6o.menu.clocko.20internal=20 MHz internal
atxy6o.menu.clocko.16internal=16 MHz internal
atxy6o.menu.clocko.10internal=10 MHz internal
atxy6o.menu.clocko.8internal=8 MHz internal
atxy6o.menu.clocko.5internal=5 MHz internal
atxy6o.menu.clocko.4internal=4 MHz internal
atxy6o.menu.clocko.1internal=1 MHz internal
atxy6o.menu.clocko.20internaltuned=20 MHz internal - tuned
atxy6o.menu.clocko.16internaltuned=16 MHz internal - tuned
atxy6o.menu.clocko.12internaltuned=12 MHz internal - tuned
atxy6o.menu.clocko.20extclock=20 MHz external clock
atxy6o.menu.clocko.16extclock=16 MHz external clock
atxy6o.menu.clocko.12extclock=12 MHz external clock
atxy6o.menu.clocko.10extclock=10 MHz external clock
atxy6o.menu.clocko.8extclock=8 MHz external clock
atxy6o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atxy6o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atxy6o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy6o.menu.clocko.24extclock=24 MHz external clock - overclocked
atxy6o.menu.clocko.25extclock=25 MHz external clock - overclocked
atxy6o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atxy6o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atxy6o.menu.clocko.20internal.build.speed=20
atxy6o.menu.clocko.20internal.build.clocksource=0
atxy6o.menu.clocko.16internal.build.speed=16
atxy6o.menu.clocko.16internal.build.clocksource=0
atxy6o.menu.clocko.10internal.build.speed=10
atxy6o.menu.clocko.10internal.build.clocksource=0
atxy6o.menu.clocko.8internal.build.speed=8
atxy6o.menu.clocko.8internal.build.clocksource=0
atxy6o.menu.clocko.5internal.build.speed=5
atxy6o.menu.clocko.5internal.build.clocksource=0
atxy6o.menu.clocko.4internal.build.speed=4
atxy6o.menu.clocko.4internal.build.clocksource=0
atxy6o.menu.clocko.1internal.build.speed=1
atxy6o.menu.clocko.1internal.build.clocksource=0
atxy6o.menu.clocko.20extclock.build.speed=20
atxy6o.menu.clocko.20extclock.build.clocksource=2
atxy6o.menu.clocko.16extclock.build.speed=16
atxy6o.menu.clocko.16extclock.build.clocksource=2
atxy6o.menu.clocko.12extclock.build.speed=12
atxy6o.menu.clocko.12extclock.build.clocksource=2
atxy6o.menu.clocko.10extclock.build.speed=10
atxy6o.menu.clocko.10extclock.build.clocksource=2
atxy6o.menu.clocko.8extclock.build.speed=8
atxy6o.menu.clocko.8extclock.build.clocksource=2
atxy6o.menu.clocko.24extclock.build.speed=24
atxy6o.menu.clocko.24extclock.build.clocksource=2
atxy6o.menu.clocko.25extclock.build.speed=24
atxy6o.menu.clocko.25extclock.build.clocksource=2
atxy6o.menu.clocko.30extclock.build.speed=30
atxy6o.menu.clocko.30extclock.build.clocksource=2
atxy6o.menu.clocko.32extclock.build.speed=32
atxy6o.menu.clocko.32extclock.build.clocksource=2
atxy6o.menu.clocko.20internaltuned.build.speed=20
atxy6o.menu.clocko.20internaltuned.build.clocksource=0
atxy6o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.16internaltuned.build.speed=16
atxy6o.menu.clocko.16internaltuned.build.clocksource=0
atxy6o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.12internaltuned.build.speed=12
atxy6o.menu.clocko.12internaltuned.build.clocksource=0
atxy6o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.24internaltuned.build.speed=24
atxy6o.menu.clocko.24internaltuned.build.clocksource=0
atxy6o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.25internaltuned.build.speed=25
atxy6o.menu.clocko.25internaltuned.build.clocksource=0
atxy6o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.30internaltuned.build.speed=30
atxy6o.menu.clocko.30internaltuned.build.clocksource=0
atxy6o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.5internal.bootloader.OSCCFG=0x02

### MILLIS TIMER
atxy6o.menu.millis.enabled=Enabled (default timer)
atxy6o.menu.millis.disabled=Disabled (saves flash)
atxy6o.menu.millis.timera=TCA0 (default on 0-series)
atxy6o.menu.millis.timerd=TCD0 (1-series only, default there)
atxy6o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy6o.menu.millis.timerb1=TCB1 (3216, 1616 only)
atxy6o.menu.millis.rtc=RTC (no micros)
atxy6o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1-series only, no micros)
atxy6o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1-series only, no micros)
atxy6o.menu.millis.disabled.build.millistimer=NONE
atxy6o.menu.millis.timera.build.millistimer=A0
atxy6o.menu.millis.timerd.build.millistimer=D0
atxy6o.menu.millis.timerb0.build.millistimer=B0
atxy6o.menu.millis.timerb1.build.millistimer=B1
atxy6o.menu.millis.rtc.build.millistimer=RTC
atxy6o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy6o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

### BOD VOLTAGE
atxy6o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy6o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy6o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy6o.menu.bodvoltage.2v1=2.1V
atxy6o.menu.bodvoltage.2v9=2.9V
atxy6o.menu.bodvoltage.3v3=3.3V
atxy6o.menu.bodvoltage.3v7=3.7V
atxy6o.menu.bodvoltage.4v0=4.0V
atxy6o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy6o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy6o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy6o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy6o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy6o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy6o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy6o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

