SpenceKonde/megaTinyCore/megaavr/boards.txt
### BOD MODE
atxy4o.menu.bodmode.disabled=Disabled/Disabled
atxy4o.menu.bodmode.enabled=Enabled/Enabled
atxy4o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy4o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy4o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy4o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy4o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy4o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy4o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy4o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy4o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy4o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy4o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy4o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy4o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy4o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy4o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy4o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100


### BOOTLOADER UART PINS
atxy4o.menu.bootloaderuart.default=TX:5 (PB2), RX:4 (PB3)
atxy4o.menu.bootloaderuart.alternate=TX:8 (PA1), RX:9 (PA2)
atxy4o.menu.bootloaderuart.default.bootloader.uartswap=
atxy4o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

### UPDI/RESET PIN CONFIGURATION & OPTIBOOT ENTRY
atxy4o.menu.resetpinopti.UPDI=UPDI, Optiboot for 8 sec. after power-on & reset
atxy4o.menu.resetpinopti.UPDI.bootloader.file=optiboot_txyz{bootloader.uartswap}.hex
atxy4o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy4o.menu.resetpinopti.UPDIFastBoot=UPDI, Optiboot for 1 sec. after power-on & reset
atxy4o.menu.resetpinopti.UPDIFastBoot.bootloader.file=optiboot_txyz{bootloader.uartswap}_1sec.hex
atxy4o.menu.resetpinopti.UPDIFastBoot.bootloader.resetpinbits=01
atxy4o.menu.resetpinopti.reset=Reset, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atxy4o.menu.resetpinopti.reset.bootloader.file=optiboot_txyz{bootloader.uartswap}_rst.hex
atxy4o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy4o.menu.resetpinopti.gpio=GPIO, Optiboot for 8 sec. after power-on & SW reset *DANGER* HV programmer req'd for reprogramming! (PCHV)
atxy4o.menu.resetpinopti.gpio.bootloader.file=optiboot_txyz{bootloader.uartswap}.hex
atxy4o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

### STARTUP TIME (SUT)
atxy4o.menu.startuptimeopti.8=8ms
atxy4o.menu.startuptimeopti.0=0ms
atxy4o.menu.startuptimeopti.1=1ms
atxy4o.menu.startuptimeopti.2=2ms
atxy4o.menu.startuptimeopti.4=4ms
atxy4o.menu.startuptimeopti.16=16ms
atxy4o.menu.startuptimeopti.32=32ms
atxy4o.menu.startuptimeopti.64=64ms
atxy4o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atxy4o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atxy4o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atxy4o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atxy4o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atxy4o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atxy4o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atxy4o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

### TWI OPTIONS
atxy4o.menu.wire.mors=Master or Slave (saves Flash & RAM)
atxy4o.menu.wire.mors.build.wire=MORS
atxy4o.menu.wire.mands=Master and Slave
atxy4o.menu.wire.mands.build.wire=MANDS

############################################################################
#  WITH OPTIBOOT                                                    ##   ###
#  2-series                      #    #  #     ####   ###  #   #    ##   ###
#                               ##    #  #     #   #   #   ##  #    ##   ###
#  ATtiny3224/1624               #    #### ### ####    #   # # #    ##   ###
#  ATtiny824/424                 #       #     #       #   #  ##    ##   ###
#                               ###      #     #      ###  #   #    ##   ###
#___________________________________________________________________##___###

### BUILD PARAMETERS
atx24o.build.text_section_start=.text=0x200
atx24o.build.millistimer=B1
atx24o.build.bootload=opti
atx24o.build.board=AVR_ATtinyxy4
atx24o.build.clocksource=0
atx24o.build.core=megatinycore
atx24o.build.variant=txy4
atx24o.build.tuned=
atx24o.build.mcu=attiny{build.attiny}
atx24o.build.f_cpu={build.speed}000000L
atx24o.build.extra_flags=-DARDUINO_attinyx24 -DMILLIS_USE_TIMER{build.millistimer} -DTWI_{build.wire} -DUSING_OPTIBOOT {build.tuned}
atx24o.build.export_merged_output=true

##############################
###     FUSE VALUES AND    ###
### BOOTLOADING PARAMETERS ###
##############################

atx24o.bootloader.WDTCFG=0x00
atx24o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atx24o.bootloader.OSCCFG=0x01
atx24o.bootloader.TCD0CFG_avrdude=
atx24o.bootloader.TCD0CFG_serialupdi=
atx24o.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}10
atx24o.bootloader.APPEND=0x00
atx24o.bootloader.BOOTEND=0x02
atx24o.bootloader.tool=avrdude
atx24o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atx24o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write

###########################
### UPLOAD VIA OPTIBOOT ###
###########################

atx24o.upload.workaround=
atx24o.upload.tool=avrdude
atx24o.upload.serialparams=-P{serial.port} -b115200
atx24o.upload.protocol=arduino
atx24o.upload.extra_params=-D

### CHIP
atx24o.menu.chip.3224=ATtiny3224
atx24o.menu.chip.3224.build.board=AVR_ATtiny3224
atx24o.menu.chip.3224.build.attiny=3224
atx24o.menu.chip.3224.upload.maximum_size=15872
atx24o.menu.chip.3224.upload.maximum_data_size=3072
atx24o.menu.chip.1624=ATtiny1624
atx24o.menu.chip.1624.build.board=AVR_ATtiny1624
atx24o.menu.chip.1624.build.attiny=1624
atx24o.menu.chip.1624.upload.maximum_size=15872
atx24o.menu.chip.1624.upload.maximum_data_size=2048
atx24o.menu.chip.824=ATtiny824
atx24o.menu.chip.824.build.board=AVR_ATtiny824
atx24o.menu.chip.824.build.attiny=824
atx24o.menu.chip.824.upload.maximum_size=7680
atx24o.menu.chip.824.upload.maximum_data_size=1024
atx24o.menu.chip.424=ATtiny424
atx24o.menu.chip.424.build.board=AVR_ATtiny424
atx24o.menu.chip.424.build.attiny=424
atx24o.menu.chip.424.upload.maximum_size=3584
atx24o.menu.chip.424.upload.maximum_data_size=512

### CLOCK SOURCE
atx24o.menu.clocko.20internal=20 MHz internal
atx24o.menu.clocko.16internal=16 MHz internal
atx24o.menu.clocko.10internal=10 MHz internal
atx24o.menu.clocko.8internal=8 MHz internal
atx24o.menu.clocko.5internal=5 MHz internal
atx24o.menu.clocko.4internal=4 MHz internal
atx24o.menu.clocko.1internal=1 MHz internal
atx24o.menu.clocko.20internaltuned=20 MHz internal - tuned
atx24o.menu.clocko.16internaltuned=16 MHz internal - tuned
atx24o.menu.clocko.12internaltuned=12 MHz internal - tuned
atx24o.menu.clocko.20extclock=20 MHz external clock
atx24o.menu.clocko.16extclock=16 MHz external clock
atx24o.menu.clocko.12extclock=12 MHz external clock
atx24o.menu.clocko.10extclock=10 MHz external clock
atx24o.menu.clocko.8extclock=8 MHz external clock
atx24o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atx24o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atx24o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atx24o.menu.clocko.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atx24o.menu.clocko.24extclock=24 MHz external clock - overclocked
atx24o.menu.clocko.25extclock=25 MHz external clock - overclocked
atx24o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atx24o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atx24o.menu.clocko.20internal.build.speed=20
atx24o.menu.clocko.20internal.build.clocksource=0
atx24o.menu.clocko.16internal.build.speed=16
atx24o.menu.clocko.16internal.build.clocksource=0
atx24o.menu.clocko.10internal.build.speed=10
atx24o.menu.clocko.10internal.build.clocksource=0
atx24o.menu.clocko.8internal.build.speed=8
atx24o.menu.clocko.8internal.build.clocksource=0
atx24o.menu.clocko.5internal.build.speed=5
atx24o.menu.clocko.5internal.build.clocksource=0
atx24o.menu.clocko.4internal.build.speed=4
atx24o.menu.clocko.4internal.build.clocksource=0
atx24o.menu.clocko.1internal.build.speed=1
atx24o.menu.clocko.1internal.build.clocksource=0
atx24o.menu.clocko.20extclock.build.speed=20
atx24o.menu.clocko.20extclock.build.clocksource=2
atx24o.menu.clocko.16extclock.build.speed=16
atx24o.menu.clocko.16extclock.build.clocksource=2
atx24o.menu.clocko.12extclock.build.speed=12
atx24o.menu.clocko.12extclock.build.clocksource=2
atx24o.menu.clocko.10extclock.build.speed=10
atx24o.menu.clocko.10extclock.build.clocksource=2
atx24o.menu.clocko.8extclock.build.speed=8
atx24o.menu.clocko.8extclock.build.clocksource=2
atx24o.menu.clocko.24extclock.build.speed=24
atx24o.menu.clocko.24extclock.build.clocksource=2
atx24o.menu.clocko.25extclock.build.speed=24
atx24o.menu.clocko.25extclock.build.clocksource=2
atx24o.menu.clocko.30extclock.build.speed=30
atx24o.menu.clocko.30extclock.build.clocksource=2
atx24o.menu.clocko.32extclock.build.speed=32
atx24o.menu.clocko.32extclock.build.clocksource=2
atx24o.menu.clocko.20internaltuned.build.speed=20
atx24o.menu.clocko.20internaltuned.build.clocksource=0
atx24o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.16internaltuned.build.speed=16
atx24o.menu.clocko.16internaltuned.build.clocksource=0
atx24o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.12internaltuned.build.speed=12
atx24o.menu.clocko.12internaltuned.build.clocksource=0
atx24o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.24internaltuned.build.speed=24
atx24o.menu.clocko.24internaltuned.build.clocksource=0
atx24o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.25internaltuned.build.speed=25
atx24o.menu.clocko.25internaltuned.build.clocksource=0
atx24o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.30internaltuned.build.speed=30
atx24o.menu.clocko.30internaltuned.build.clocksource=0
atx24o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.32internaltuned.build.speed=32
atx24o.menu.clocko.32internaltuned.build.clocksource=0
atx24o.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atx24o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atx24o.menu.clocko.5internal.bootloader.OSCCFG=0x02

### MILLIS TIMER
atx24o.menu.millis.enabled=Enabled (default timer, TCB1)
atx24o.menu.millis.disabled=Disabled (saves flash)
atx24o.menu.millis.timera=TCA0
atx24o.menu.millis.timerb0=TCB0
atx24o.menu.millis.timerb1=TCB1 (default)
atx24o.menu.millis.rtc=RTC (no micros)
atx24o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal
atx24o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator
atx24o.menu.millis.disabled.build.millistimer=NONE
atx24o.menu.millis.timera.build.millistimer=A0
atx24o.menu.millis.timerb0.build.millistimer=B0
atx24o.menu.millis.timerb1.build.millistimer=B1
atx24o.menu.millis.rtc.build.millistimer=RTC
atx24o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atx24o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

### BODVOLTAGE
atx24o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atx24o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atx24o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atx24o.menu.bodvoltage.2v1=2.1V
atx24o.menu.bodvoltage.2v9=2.9V
atx24o.menu.bodvoltage.3v3=3.3V
atx24o.menu.bodvoltage.3v7=3.7V
atx24o.menu.bodvoltage.4v0=4.0V
atx24o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atx24o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atx24o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atx24o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atx24o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atx24o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atx24o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atx24o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

### BODMODE
atx24o.menu.bodmode.disabled=Disabled/Disabled
atx24o.menu.bodmode.enabled=Enabled/Enabled
atx24o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atx24o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atx24o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atx24o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atx24o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atx24o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atx24o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atx24o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atx24o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atx24o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atx24o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atx24o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atx24o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atx24o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atx24o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atx24o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### RESET PIN CONFIGURATION
atx24o.menu.resetpinopti.UPDI=UPDI, Optiboot for 8 sec. after power-on & reset
atx24o.menu.resetpinopti.UPDI.bootloader.file=optiboot_tx2z{bootloader.uartswap}.hex
atx24o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atx24o.menu.resetpinopti.UPDIFastBoot=UPDI, Optiboot for 1 sec. after power-on & reset
atx24o.menu.resetpinopti.UPDIFastBoot.bootloader.file=optiboot_tx2z{bootloader.uartswap}_1sec.hex
atx24o.menu.resetpinopti.UPDIFastBoot.bootloader.resetpinbits=01
atx24o.menu.resetpinopti.reset=Reset, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atx24o.menu.resetpinopti.reset.bootloader.file=optiboot_tx2z{bootloader.uartswap}_rst.hex
atx24o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atx24o.menu.resetpinopti.gpio=GPIO, Optiboot for 8 sec. after power-on & SW reset *DANGER* HV programmer req'd for reprogramming! (PCHV)
atx24o.menu.resetpinopti.gpio.bootloader.file=optiboot_tx2z{bootloader.uartswap}.hex
atx24o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

### STARTUP TIME (SUT)
atx24o.menu.startuptimeopti.8=8ms
atx24o.menu.startuptimeopti.0=0ms
atx24o.menu.startuptimeopti.1=1ms
atx24o.menu.startuptimeopti.2=2ms
atx24o.menu.startuptimeopti.4=4ms
atx24o.menu.startuptimeopti.16=16ms
atx24o.menu.startuptimeopti.32=32ms
atx24o.menu.startuptimeopti.64=64ms
atx24o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atx24o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atx24o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atx24o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atx24o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atx24o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atx24o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atx24o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

### BOOTLOADER UART PINS
atx24o.menu.bootloaderuart.default=TX:5 (PB2), RX:4 (PB3) (UART0 default pins)
atx24o.menu.bootloaderuart.alternate=TX:8 (PA1), RX:9 (PA2) (UART0 alt/UART1 default pins)
atx24o.menu.bootloaderuart.default.bootloader.uartswap=
atx24o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

### TWI OPTIONS
atx24o.menu.wire.mors=Master or Slave (saves Flash & RAM)
atx24o.menu.wire.mors.build.wire=MORS
atx24o.menu.wire.mands=Master and Slave
atx24o.menu.wire.mands.build.wire=MANDS

############################################################################
#                                                                          #
#  WITH OPTIBOOT                      ###      ####   ###  #   #           #
#  ATtiny412                         #   #     #   #   #   ##  #           #
#  ATtiny402                          ###  === ####    #   # # #           #
#  ATtiny212                         #   #     #       #   #  ##           #
#  ATtiny202                          ###      #      ###  #   #           #
#__________________________________________________________________________#

### BUILD PARAMETERS
atxy2o.build.text_section_start=.text=0x200
atxy2o.build.millistimer=D0
atxy2o.build.bootload=opti
atxy2o.build.board=AVR_ATtinyxy2
atxy2o.build.clocksource=0
atxy2o.build.core=megatinycore
atxy2o.build.variant=txy2
atxy2o.build.tuned=
atxy2o.build.mcu=attiny{build.attiny}
atxy2o.build.f_cpu={build.speed}000000L
atxy2o.build.extra_flags=-DARDUINO_attinyxy2 -DMILLIS_USE_TIMER{build.millistimer} -DUSING_OPTIBOOT {build.tuned}
atxy2o.build.export_merged_output=true

### BOOTLOADING PARAMETERS
atxy2o.bootloader.WDTCFG=0x00
atxy2o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy2o.bootloader.OSCCFG=0x01
atxy2o.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy2o.bootloader.TCD0CFG_serialupdi=4:0x00
atxy2o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy2o.bootloader.APPEND=0x00
atxy2o.bootloader.BOOTEND=0x02
atxy2o.bootloader.tool=avrdude
atxy2o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy2o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write

### UPLOAD VIA OPTIBOOT
atxy2o.upload.workaround=
atxy2o.upload.upload.serialparams=-P{serial.port} -b115200
atxy2o.upload.tool=avrdude
atxy2o.upload.protocol=arduino
atxy2o.upload.extra_params=-D

