SpenceKonde/megaTinyCore/megaavr/boards.txt
### CHIP
atxy2o.menu.chip.412=ATtiny412
atxy2o.menu.chip.412.build.board=AVR_ATtiny412
atxy2o.menu.chip.412.build.attiny=412
atxy2o.menu.chip.412.upload.maximum_size=3584
atxy2o.menu.chip.412.upload.maximum_data_size=256
atxy2o.menu.chip.212=ATtiny212
atxy2o.menu.chip.212.build.board=AVR_ATtiny212
atxy2o.menu.chip.212.build.attiny=212
atxy2o.menu.chip.212.upload.maximum_size=1536
atxy2o.menu.chip.212.upload.maximum_data_size=128
atxy2o.menu.chip.402=ATtiny402
atxy2o.menu.chip.402.build.board=AVR_ATtiny402
atxy2o.menu.chip.402.build.attiny=402
atxy2o.menu.chip.402.build.millistimer=A0
atxy2o.menu.chip.402.upload.maximum_size=3584
atxy2o.menu.chip.402.upload.maximum_data_size=256
atxy2o.menu.chip.402.TCD0CFG_avrdude=
atxy2o.menu.chip.402.TCD0CFG_serialupdi=
atxy2o.menu.chip.402w=ATtiny402 (bad signature)
atxy2o.menu.chip.402w.build.attiny=402
atxy2o.menu.chip.402w.build.board=AVR_ATtiny402
atxy2o.menu.chip.402w.build.millistimer=A0
atxy2o.menu.chip.402w.upload.maximum_size=3584
atxy2o.menu.chip.402w.upload.maximum_data_size=256
atxy2o.menu.chip.402.TCD0CFG_avrdude=
atxy2o.menu.chip.402.TCD0CFG_serialupdi=
atxy2o.menu.chip.402w.upload.workaround=w
atxy2o.menu.chip.202=ATtiny202
atxy2o.menu.chip.202.build.board=AVR_ATtiny202
atxy2o.menu.chip.202.build.attiny=202
atxy2o.menu.chip.202.build.millistimer=A0
atxy2o.menu.chip.202.upload.maximum_size=1536
atxy2o.menu.chip.202.upload.maximum_data_size=128
atxy2o.menu.chip.202.TCD0CFG_avrdude=
atxy2o.menu.chip.202.TCD0CFG_serialupdi=

### CLOCK SOURCE
atxy2o.menu.clocko.20internal=20 MHz internal
atxy2o.menu.clocko.16internal=16 MHz internal
atxy2o.menu.clocko.10internal=10 MHz internal
atxy2o.menu.clocko.8internal=8 MHz internal
atxy2o.menu.clocko.5internal=5 MHz internal
atxy2o.menu.clocko.4internal=4 MHz internal
atxy2o.menu.clocko.1internal=1 MHz internal
atxy2o.menu.clocko.20internaltuned=20 MHz internal - tuned
atxy2o.menu.clocko.16internaltuned=16 MHz internal - tuned
atxy2o.menu.clocko.12internaltuned=12 MHz internal - tuned
atxy2o.menu.clocko.20extclock=20 MHz external clock
atxy2o.menu.clocko.16extclock=16 MHz external clock
atxy2o.menu.clocko.12extclock=12 MHz external clock
atxy2o.menu.clocko.10extclock=10 MHz external clock
atxy2o.menu.clocko.8extclock=8 MHz external clock
atxy2o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atxy2o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atxy2o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy2o.menu.clocko.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atxy2o.menu.clocko.24extclock=24 MHz external clock - overclocked
atxy2o.menu.clocko.25extclock=25 MHz external clock - overclocked
atxy2o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atxy2o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atxy2o.menu.clocko.20internal.build.speed=20
atxy2o.menu.clocko.20internal.build.clocksource=0
atxy2o.menu.clocko.16internal.build.speed=16
atxy2o.menu.clocko.16internal.build.clocksource=0
atxy2o.menu.clocko.10internal.build.speed=10
atxy2o.menu.clocko.10internal.build.clocksource=0
atxy2o.menu.clocko.8internal.build.speed=8
atxy2o.menu.clocko.8internal.build.clocksource=0
atxy2o.menu.clocko.5internal.build.speed=5
atxy2o.menu.clocko.5internal.build.clocksource=0
atxy2o.menu.clocko.4internal.build.speed=4
atxy2o.menu.clocko.4internal.build.clocksource=0
atxy2o.menu.clocko.1internal.build.speed=1
atxy2o.menu.clocko.1internal.build.clocksource=0
atxy2o.menu.clocko.20extclock.build.speed=20
atxy2o.menu.clocko.20extclock.build.clocksource=2
atxy2o.menu.clocko.16extclock.build.speed=16
atxy2o.menu.clocko.16extclock.build.clocksource=2
atxy2o.menu.clocko.12extclock.build.speed=12
atxy2o.menu.clocko.12extclock.build.clocksource=2
atxy2o.menu.clocko.10extclock.build.speed=10
atxy2o.menu.clocko.10extclock.build.clocksource=2
atxy2o.menu.clocko.8extclock.build.speed=8
atxy2o.menu.clocko.8extclock.build.clocksource=2
atxy2o.menu.clocko.24extclock.build.speed=24
atxy2o.menu.clocko.24extclock.build.clocksource=2
atxy2o.menu.clocko.25extclock.build.speed=24
atxy2o.menu.clocko.25extclock.build.clocksource=2
atxy2o.menu.clocko.30extclock.build.speed=30
atxy2o.menu.clocko.30extclock.build.clocksource=2
atxy2o.menu.clocko.32extclock.build.speed=32
atxy2o.menu.clocko.32extclock.build.clocksource=2
atxy2o.menu.clocko.20internaltuned.build.speed=20
atxy2o.menu.clocko.20internaltuned.build.clocksource=0
atxy2o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.16internaltuned.build.speed=16
atxy2o.menu.clocko.16internaltuned.build.clocksource=0
atxy2o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.12internaltuned.build.speed=12
atxy2o.menu.clocko.12internaltuned.build.clocksource=0
atxy2o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.24internaltuned.build.speed=24
atxy2o.menu.clocko.24internaltuned.build.clocksource=0
atxy2o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.25internaltuned.build.speed=25
atxy2o.menu.clocko.25internaltuned.build.clocksource=0
atxy2o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.30internaltuned.build.speed=30
atxy2o.menu.clocko.30internaltuned.build.clocksource=0
atxy2o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.32internaltuned.build.speed=32
atxy2o.menu.clocko.32internaltuned.build.clocksource=0
atxy2o.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy2o.menu.clocko.5internal.bootloader.OSCCFG=0x02

### MILLIS TIMER
atxy2o.menu.millis.enabled=Enabled (default timer)
atxy2o.menu.millis.disabled=Disabled (saves flash)
atxy2o.menu.millis.timera=TCA0 (default on 402/202)
atxy2o.menu.millis.timerd=TCD0 (412/212 only, default there)
atxy2o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy2o.menu.millis.rtc=RTC (no micros)
atxy2o.menu.millis.disabled.build.millistimer=NONE
atxy2o.menu.millis.timera.build.millistimer=A0
atxy2o.menu.millis.timerd.build.millistimer=D0
atxy2o.menu.millis.timerb0.build.millistimer=B0
atxy2o.menu.millis.rtc.build.millistimer=RTC

### BOD VOLTAGE
atxy2o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy2o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy2o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy2o.menu.bodvoltage.2v1=2.1V
atxy2o.menu.bodvoltage.2v9=2.9V
atxy2o.menu.bodvoltage.3v3=3.3V
atxy2o.menu.bodvoltage.3v7=3.7V
atxy2o.menu.bodvoltage.4v0=4.0V
atxy2o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy2o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy2o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy2o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy2o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy2o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy2o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy2o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

